In [1]:
import pandas as pd
import sqlite3

In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\appscript\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\users\appscript\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\appscript\anaconda3\lib\site-packages (from ipython-sql) (1.2.11)
Requirement already satisfied: prettytable<1 in c:\users\appscript\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\users\appscript\anaconda3\lib\site-packages (from ipython-sql) (7.27.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\appscript\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\appscript\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: backcall in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: matplotlib-inline in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: colorama in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.3.9)
Requirement already satisfied: pickleshare in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.4)
Requirement already satisfied: jedi>=0.16 in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: setuptools>=18.5 in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: decorator in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.0)
Requirement already satisfied: pygments in c:\users\appscript\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\appscript\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\appscript\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)

In [3]:
d1=pd.DataFrame({'name':['akbar','hari','krishna','deva','karthik','charan'],'age':[23,25,26,28,22,26],'location':['pdtr','hyd','bglr','pune','pdvla','pdtr']})

In [7]:
cnn=sqlite3.connect('akbar_database.db')

In [8]:
d1

      name  age location
0    akbar   23     pdtr
1     hari   25      hyd
2  krishna   26     bglr
3     deva   28     pune
4  karthik   22    pdvla
5   charan   26     pdtr

In [9]:
d1.to_sql('appscriptsoftwares',cnn)

In [10]:
%load_ext sql

In [11]:
%sql sqlite:///akbar_database.db

In [12]:
%%sql
select * from appscriptsoftwares

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'),
 (1, 'hari', 25, 'hyd'),
 (2, 'krishna', 26, 'bglr'),
 (3, 'deva', 28, 'pune'),
 (4, 'karthik', 22, 'pdvla'),
 (5, 'charan', 26, 'pdtr')]

In [13]:
sf=pd.read_csv('dd2.csv')
sf

,Symbol,ClosingPrice,Eps,Shares,OutStanding(M),P/E Market,Cap(B) Beta
0,AAPL,501.53,40.32,892.45,12.44,447.59,0.84
1,AMZN,346.15,0.59,459.00,589.80,158.88,0.52
2,FB,61.48,0.59,2450.00,104.93,150.92,NAN
3,GOOG,1133.43,36.05,335.53,31.44,380.64,0.87
4,TWTR,65.25,-0.30,555.20,NaN,36.23,NAN
5,YHOO,34.90,1.27,1010.00,27.48,35.36,0.66

In [15]:
sf.to_sql('aipandits',cnn)

In [16]:
%%sql
select * from aipandits

 * sqlite:///akbar_database.db
Done.

[(0, 'AAPL  ', 501.53, 40.32, 892.45, 12.44, 447.59, '0.84'),
 (1, 'AMZN   ', 346.15, 0.59, 459.0, 589.8, 158.88, '0.52'),
 (2, 'FB', 61.48, 0.59, 2450.0, 104.93, 150.92, 'NAN'),
 (3, 'GOOG', 1133.43, 36.05, 335.53, 31.44, 380.64, '0.87'),
 (4, 'TWTR', 65.25, -0.3, 555.2, None, 36.23, 'NAN'),
 (5, 'YHOO', 34.9, 1.27, 1010.0, 27.48, 35.36, '0.66')]

In [17]:
%%sql
select count(*) from appscriptsoftwares

 * sqlite:///akbar_database.db
Done.

[(6,)]

In [18]:
%%sql
select count(*) from aipandits

 * sqlite:///akbar_database.db
Done.

[(6,)]

In [19]:
%%sql
select sum(age) as total_age from appscriptsoftwares

 * sqlite:///akbar_database.db
Done.

[(150,)]

In [23]:
%%sql
select * from aipandits

 * sqlite:///akbar_database.db
Done.

[(0, 'AAPL  ', 501.53, 40.32, 892.45, 12.44, 447.59, '0.84'),
 (1, 'AMZN   ', 346.15, 0.59, 459.0, 589.8, 158.88, '0.52'),
 (2, 'FB', 61.48, 0.59, 2450.0, 104.93, 150.92, 'NAN'),
 (3, 'GOOG', 1133.43, 36.05, 335.53, 31.44, 380.64, '0.87'),
 (4, 'TWTR', 65.25, -0.3, 555.2, None, 36.23, 'NAN'),
 (5, 'YHOO', 34.9, 1.27, 1010.0, 27.48, 35.36, '0.66')]

In [35]:
%%sql
select shares,closingprice,symbol from aipandits

 * sqlite:///akbar_database.db
Done.

[(892.45, 501.53, 'AAPL  '),
 (459.0, 346.15, 'AMZN   '),
 (2450.0, 61.48, 'FB'),
 (335.53, 1133.43, 'GOOG'),
 (555.2, 65.25, 'TWTR'),
 (1010.0, 34.9, 'YHOO')]

In [36]:
%%sql
SELECT *
  FROM appscriptsoftwares
 LIMIT 2

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'), (1, 'hari', 25, 'hyd')]

In [37]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age = 23

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr')]

In [38]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age > 25

 * sqlite:///akbar_database.db
Done.

[(2, 'krishna', 26, 'bglr'),
 (3, 'deva', 28, 'pune'),
 (5, 'charan', 26, 'pdtr')]

In [40]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE name != 'akbar'

 * sqlite:///akbar_database.db
Done.

[(1, 'hari', 25, 'hyd'),
 (2, 'krishna', 26, 'bglr'),
 (3, 'deva', 28, 'pune'),
 (4, 'karthik', 22, 'pdvla'),
 (5, 'charan', 26, 'pdtr')]

In [41]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age > 26

 * sqlite:///akbar_database.db
Done.

[(3, 'deva', 28, 'pune')]

SQL Logical operators In the previous lesson, you played with some comparison operators to filter data. You’ll likely also want to filter data using several conditions—possibly more often than you'll want to filter by only one condition. Logical operators allow you to use multiple comparison operators in one query.

Each logical operator is a special snowflake, so we'll go through them individually in the following lessons. Here's a quick preview:

LIKE allows you to match similar values, instead of exact values. IN allows you to specify a list of values you'd like to include. BETWEEN allows you to select only rows within a certain range. IS NULL allows you to select rows that contain no data in a given column. AND allows you to select only rows that satisfy two conditions. OR allows you to select rows that satisfy either of two conditions. NOT allows you to select rows that do not match a certain condition.

In [55]:
%%sql
SELECT *
  FROM appscriptsoftwares
 ORDER BY name,age

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'),
 (5, 'charan', 26, 'pdtr'),
 (3, 'deva', 28, 'pune'),
 (1, 'hari', 25, 'hyd'),
 (4, 'karthik', 22, 'pdvla'),
 (2, 'krishna', 26, 'bglr')]

In [59]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE "location" LIKE '%y%'

 * sqlite:///akbar_database.db
Done.

[(1, 'hari', 25, 'hyd')]

In [60]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age IN (23,26)

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'),
 (2, 'krishna', 26, 'bglr'),
 (5, 'charan', 26, 'pdtr')]

In [61]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age BETWEEN 5 AND 25

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'), (1, 'hari', 25, 'hyd'), (4, 'karthik', 22, 'pdvla')]

In [63]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age >= 5 AND age <= 25

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'), (1, 'hari', 25, 'hyd'), (4, 'karthik', 22, 'pdvla')]

In [64]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age IS NULL

 * sqlite:///akbar_database.db
Done.

[]

In [65]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE name = 'akbar'
   AND age <= 50
   AND "location" LIKE '%r%'

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr')]

In [74]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age = 25 OR name = 'a'

 * sqlite:///akbar_database.db
Done.

[(1, 'hari', 25, 'hyd')]

In [76]:
%%sql
SELECT *
  FROM appscriptsoftwares
WHERE name = 'akbar'
   AND ("location" LIKE '%dt%' OR "location" LIKE '%br%')

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr')]

In [78]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE name = 'akbar'
   AND age NOT BETWEEN 10 AND 20

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr')]

In [80]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age = 26
   AND "location" NOT LIKE '%bgl%'

 * sqlite:///akbar_database.db
Done.

[(5, 'charan', 26, 'pdtr')]

In [82]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE name = 'akbar'
   AND 'location' IS NOT NULL

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr')]

In [84]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age = 25
 ORDER BY name

 * sqlite:///akbar_database.db
Done.

[(1, 'hari', 25, 'hyd')]

In [88]:
%%sql
SELECT *
  FROM appscriptsoftwares
 WHERE age <= 50
 ORDER BY name, location DESC

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'),
 (5, 'charan', 26, 'pdtr'),
 (3, 'deva', 28, 'pune'),
 (1, 'hari', 25, 'hyd'),
 (4, 'karthik', 22, 'pdvla'),
 (2, 'krishna', 26, 'bglr')]

In [89]:
%%sql
SELECT *
  FROM appscriptSOFTWARES
 WHERE age <= 40
 ORDER BY 2, 1 DESC

 * sqlite:///akbar_database.db
Done.

[(0, 'akbar', 23, 'pdtr'),
 (5, 'charan', 26, 'pdtr'),
 (3, 'deva', 28, 'pune'),
 (1, 'hari', 25, 'hyd'),
 (4, 'karthik', 22, 'pdvla'),
 (2, 'krishna', 26, 'bglr')]